test-scenarios/scenario1-step1-tour-to-bkrt.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:makeFullFundTransfer>
         <web:cm_user_name>bora</web:cm_user_name>
         <web:cm_password>B@ora123</web:cm_password>
         <web:ext_ref>TOURKHPPXXX/BKRTKHPPXXX/9999888877</web:ext_ref>
         <web:iso_message><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<Document xsi:schemaLocation="xsd/pain.001.001.05.xsd" xmlns="urn:iso:std:iso:20022:tech:xsd:pain.001.001.05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <CstmrCdtTrfInitn>
        <GrpHdr>
            <MsgId>CRTTOURKHPPXXX1738268500999</MsgId>
            <CreDtTm>2026-01-30T18:01:40.999+07:00</CreDtTm>
            <NbOfTxs>1</NbOfTxs>
            <CtrlSum>200000</CtrlSum>
            <InitgPty>
                <Nm>TOUR</Nm>
            </InitgPty>
        </GrpHdr>
        <PmtInf>
            <PmtInfId>TOURKHPPXXX/BKRTKHPPXXX/9999888877</PmtInfId>
            <PmtMtd>TRF</PmtMtd>
            <BtchBookg>false</BtchBookg>
            <ReqdExctnDt>2026-01-30</ReqdExctnDt>
            <Dbtr>
                <Nm>TOUR</Nm>
            </Dbtr>
            <DbtrAcct>
                <Id>
                    <Othr>
                        <Id>015039685739105</Id>
                    </Othr>
                </Id>
                <Ccy>KHR</Ccy>
            </DbtrAcct>
            <DbtrAgt>
                <FinInstnId>
                    <BICFI>TOURKHPPXXX</BICFI>
                </FinInstnId>
            </DbtrAgt>
            <CdtTrfTxInf>
                <PmtId>
                    <InstrId>TOURKHPPXXX/9999888877</InstrId>
                    <EndToEndId>015039685739105-bkrtkhppxxx@bkrt</EndToEndId>
                </PmtId>
                <Amt>
                    <InstdAmt Ccy="KHR">200000</InstdAmt>
                </Amt>
                <ChrgBr>CRED</ChrgBr>
                <CdtrAgt>
                    <FinInstnId>
                        <BICFI>BKRTKHPPXXX</BICFI>
                    </FinInstnId>
                </CdtrAgt>
                <Cdtr>
                    <Nm>BKRT Recipient</Nm>
                </Cdtr>
                <CdtrAcct>
                    <Id>
                        <Othr>
                            <Id>bkrtkhppxxx@bkrt</Id>
                        </Othr>
                    </Id>
                </CdtrAcct>
                <Purp>
                    <Cd>GDDS</Cd>
                </Purp>
                <RmtInf>
                    <Ustrd>Scenario1 - Initial Payment TOUR to BKRT</Ustrd>
                    <Strd>
                        <RfrdDocInf>
                            <Tp>
                                <CdOrPrtry>
                                    <Cd>CINV</Cd>
                                </CdOrPrtry>
                            </Tp>
                            <Nb>1</Nb>
                            <RltdDt>2026-01-30+07:00</RltdDt>
                        </RfrdDocInf>
                        <AddtlRmtInf>Phnom Penh/9999888877</AddtlRmtInf>
                    </Strd>
                </RmtInf>
            </CdtTrfTxInf>
        </PmtInf>
    </CstmrCdtTrfInitn>
</Document>]]></web:iso_message>
      </web:makeFullFundTransfer>
   </soapenv:Body>
</soapenv:Envelope>
